{
  "additionalCosts": "",
  "assessments": [
    {
      "tab": "On Campus, UK",
      "tabAssessments": [
        { "outcomes": "2,3", "label": "Coursework", "category": "Coursework", "percent": "30" },
        { "outcomes": "1,3,4,5", "label": "Coursework", "category": "Coursework", "percent": "70" },
        { "outcomes": "2,3", "label": "Coursework", "category": "Coursework", "percent": "0" },
        { "outcomes": "3,4,5", "label": "Coursework", "category": "Coursework", "percent": "0" }
      ]
    }
  ],
  "attendanceRequirements": "Your engagement with learning materials and activities and attendance at scheduled live sessions and other events is extremely important. Full engagement in your studies will enable you to get the most out of the course and help you perform at your best when it comes to assessment.\r\n\r\nWe expect you to engage with all aspects of this module and with your programme of study.  You should:\r\n\r\n\r\n\tEngage with all module materials, activities, and online timetabled teaching sessions\r\n\tActively participate in discussions and practical activities\r\n\tPrepare in advance of live sessions by undertaking the required reading and/or other forms of preparation\r\n\tSubmit coursework/assessments by the due time and date\r\n\tComplete class tests and examinations at the specified time and date\r\n\tMake your module co-ordinator aware at the earliest opportunity if you experience problems which may impact on your engagement\r\n\tInform the University of absence from study (planned or unplanned), e.g. illness, emergency as outlined at http://www.stir.ac.uk/registry/studentinformation/absence\r\n\tRespond to e-mails from your personal tutor, module co-ordinator or programme director and attend meetings if requested.\r\n\tEngage with in-sessional English language classes (if applicable)\r\n\r\n\r\nWe will monitor these aspects throughout each semester to check that you are fully participating and that you are coping well with your studies. Some activities may be prescribed, failure to engage with 2/3 of prescribed activities will result in your module grade being capped at the pass mark (40 for Undergraduate modules, 50 for Postgraduate modules).\r\n",
  "deliveries": [
    { "hours": "48", "typekey": "10", "description": "Lectures, seminars, practical classes and workshops, external visits, scheduled on-line discussions or similar", "label": "Not required", "type": "scheduled study" },
    { "hours": "152", "typekey": "ind", "description": "Both directed learning undertaken in student's own time, and their own self-directed study for assessment ", "label": "Not required", "type": "independent study" },
    { "hours": "200", "typekey": "total", "description": "", "label": "Total Study Time", "type": "total" }
  ],
  "deliveryPeriodStartDesc": "2023/4, Autumn",
  "ectsModuleCredits": 10,
  "learningOutcomes": ["demonstrate an understanding of computer structure and functioning;", "critically discuss the relevance of computers and computing in society;", "apply theory and techniques to unseen problems, while working independently, under time constraints, without reference to notes, and demonstrating a knowledge of expected professional and academic conduct;", "demonstrate an understanding of fundamental imperative programming constructs and their use by creating simple algorithms in a high-level programming language;", "use abstract, language-independent computational thinking to solve problems in a structured and analytical manner."],
  "locationStudyMethods": ["Stirling/On Campus, UK", "Muscat College/International", "China/International", "Planet Core International Education/International"],
  "moduleCode": "CSCU9P1",
  "moduleCoordinator": "Jason Adair",
  "moduleCredits": 20,
  "moduleLevel": "SCQF LEVEL 7",
  "moduleLevelDescription": "UG",
  "moduleOverview": "<p>This module is intended for students who wish to acquire skills in computer programming and an understanding of the principles underlying computer systems and networks. It is compulsory for&nbsp;students entering degree programmes involving Computing Science, Software Engineering, Information Systems or Business Computing, but is available to all students.&nbsp;</p>\r\n\r\n<p>The goal of the module is to give you confidence in computational thinking and problem solving via programming.&nbsp;Lectures cover the basic principles of computer architecture, operating systems, and networks, and build an understanding of the multiple layers and levels of abstraction that allow computer systems&nbsp;to work.</p>\r\n\r\n<p>Computational thinking and computer programming are taught through a combination of lectures and extensive practical problem-solving exercises using the Java programming language. You&#39;ll also gain a broader view of the role of computer systems in society through group discussions on social, ethical, legal and professional issues arising in Computing.&nbsp;</p>\r\n\r\n<p>Although the module has no prerequisites, we are aware that many students are likely to have studied Computing Science at Higher or Advanced Level. The module includes advanced topics such as computational intelligence and limits of computation that are designed to engage experienced students while consolidating and extending your understanding of the fundamental topics.&nbsp;</p>\r\n",
  "moduleTitle": "Introduction to Computing Science",
  "nonCreditBearing": false,
  "owningFaculty": "Faculty of Natural Science",
  "preparedOtherInformation": "",
  "professionalAccreditation": "",
  "studyAbroad": "No",
  "version": "2.0"
}
